---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SuggestMakingFamilyNonParametric
source: html/8199581d-947f-2430-a103-cd44608b2e48.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SuggestMakingFamilyNonParametric Property

Performance Warning: This family now contains both labeled dimensions and sketches with many segments. This may hurt performance. To improve performance, create elements that require complex sketches as nested families.

## Syntax (C#)
```csharp
public static FailureDefinitionId SuggestMakingFamilyNonParametric { get; }
```